app/controllers/doctors_controller.rb

  def show
    @doctor = Doctor.find_by(id: params[:id])
---
SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]